#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "");
}

/*
	НАСЛЕДОВАНИЕ Inheritance
	Наследование это способность классов наследовать свойства других классов
	В наследовании разлечают базовый или родительский класс это класс от которого наследуют и дочерний или производный класс это класс который наследует чужие свойства
	Базовый класс(Base class) не знает сколько и каких классов от него унаследованно
	А дочерний класc(Derived class) знает только своего ближайщего родителя и не знает своих прародителей
*/